Enums/СпособыВызоваДополнительныхОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыВызоваДополнительныхОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправкаОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВызовHTTPСервиса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеОтчетыИОбработки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьДоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/РДО_ПолучениеДанных/Ext/Module.bsl
Функция УниверсальныйМетод(HTTPЗапрос)
	Массив = СтрРазделить(HTTPЗапрос.ОтносительныйURL, "/"); 
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
			|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор КАК Идентификатор,
			|	ДополнительныеОтчетыИОбработкиКоманды.Метод КАК Метод,
			|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
			|ГДЕ ИСТИНА
			|	И ДополнительныеОтчетыИОбработкиКоманды.Идентификатор = &Идентификатор
			|	И ДополнительныеОтчетыИОбработкиКоманды.Метод = &Метод
			|	И ДополнительныеОтчетыИОбработкиКоманды.ВариантЗапуска = ЗНАЧЕНИЕ(Перечисление.СпособыВызоваДополнительныхОбработок.ВызовHTTPСервиса)
			|";
	Запрос.Параметры.Вставить("Идентификатор", Массив[1]);
	Запрос.Параметры.Вставить("Метод", HTTPЗапрос.HTTPМетод);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый HTTPСервисОтвет(404);				
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("HTTPЗапрос", HTTPЗапрос);
	ПараметрыКоманды.Вставить("Метод", Выборка.Метод);
	ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", Выборка.Ссылка);
	ПараметрыКоманды.Вставить("ИдентификаторКоманды", Выборка.Идентификатор);
	Возврат ДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыКоманды).HTTPОтвет;
КонецФункции
